__all__ = ['area_dict', 'area_user_dict', 'area_stop', 'tag_dict',
           'p2p', 'ida_region', 's3.area.db', 's3.area.db.json',
           'slda_tag_dict', 'stop_dict', 'words', 'rd', 'news_path',
           'tag_word_ids']

from os.path import split as __pathSplit, realpath as __realpath

import redis

rd = redis.Redis(password='0011', encoding='utf8', db=9, decode_responses=True)
rd_2 = redis.Redis(host='172.24.31.19', password='000111', encoding='utf8', db=8, decode_responses=True)
news_path = "/data/train_data/times_news/"

__real_path = __pathSplit(__realpath(__file__))[0]

# 结巴的初始化字典（地区）
area_dict 			= __real_path + '/area_dict.txt'
# 结巴的自定义字典（地区）
area_user_dict	 	= __real_path + '/area.txt'
# 结巴的停用词字典（地区）
area_stop 			= __real_path + '/area_stop.txt'
# 结巴的关键词 TAG 字典（Tag）
tag_dict 			= __real_path + '/tag_dict.txt'
# 结巴的关键词 TAG 字典（合并了slda）
tag_lda_dict 			= __real_path + '/jb_slda.txt'
# mysql 的 ida_region 表的 json 转储
ida_region			= __real_path + '/ida_region.json'
# 地域识别的 s3.db 的地区 id 和 mysql 的地区 id 对照 json
p2p					= __real_path + '/p2p.json'
# 地域识别的 sqlite 数据库文件
s3_area_db          = __real_path + '/s3.nlp.db'
# 地域识别的 sqlite 数据的 json 转储
s3_area_db_json     = __real_path + '/s3.nlp.db.json'
# 整合了 slda + tag 关键词的字典
slda_tag_dict       = __real_path + '/mix_lda_tag.txt'
# 停用词词典
stop_dict           = __real_path + '/stop.txt'
# tag 词的 id
tag_word_ids        = __real_path + '/tagWord2id.json'


words = [
    # 体育-足球
    ['足球', '射门', '任意球', '点球', '红牌', '黄牌', '金球'],
    # 体育-足球-中国足球
    ['足球', '中超', '恒大', '国安', '鲁能', '苏宁', '上港', '申花', '国家队', '男足'],
    # 体育-足球-英超
    ['足球', '英超', '曼联', '曼城', '利物浦', '阿森纳', '切尔西'],
    # 体育-足球-德甲
    ['足球', '德甲', '拜仁', '多特蒙德', '沃尔夫斯堡', '不莱梅', '勒沃库森', '法兰克福'],
    # 体育-足球-西甲
    ['足球', '西甲', '皇马', '巴萨', '巴伦西亚', '马竞', '比利亚雷亚尔'],
    # 体育-篮球-NBA
    ['篮球', 'NBA', '火箭', '湖人', '乔丹', '马刺'],
    # 体育-篮球-中国篮球
    ['篮球', 'CBA', '宏远', '五棵松', '八一男篮', '首钢', '宏远队', '东莞队', '新疆队', '朱芳雨', '王仕鹏'],
    # 体育-篮球
    ['篮球', '投篮', '男篮', '女篮', '篮协', '扣篮', '盖帽'],
    # 体育-羽毛球
    ['羽毛球', '扣杀', '国羽', '羽球', '羽坛', '羽联'],
    # 体育- 乒乓球
    ['乒乓球', '国际乒联', '正胶', '国乒'],
    # 体育-排球
    ['排球', '拦网', '女排', '男排', '二传'],
    # 体育-拳击搏击
    ['拳击', '直拳', '金腰带', '拳王', '搏击'],
    # 体育-网球
    ['网球', '大满贯', '网坛', '红土', '发球局'],
    # 体育-赛车
    ['赛车', '赛道', '轮胎', '车手', '车队'],
    # 体育-高尔夫
    ['高尔夫', '挥杆', '小鸟球', '果岭'],
    # 体育-台球
    ['斯诺克', '台球', '丁俊晖', '奥沙利文'],
    # 体育-跑步马拉松
    ['马拉松', '中长跑', '半马', '越野跑', '跑者'],
    # 体育-围棋
    ['围棋', '棋谱', '九段', '中国棋院'],
    # 体育-游泳
    ['游泳', '泳池', '自由泳', '仰泳', '游泳队', '三米板'],
    # 体育-博彩
    ['体彩', '欧赔', '足彩', '盘口'],
    # 体育-奥运
    ['奥运会', '冬奥会', '残奥会'],
    # 体育-体操
    ['体操', '单杠', '双杠', '鞍马', '吊环', '自由操'],

    # 财经-股票
    ['财经', '股票', '股价', '大盘', '市值', '创业板', '证监会'],
    # 财经-基金
    ['财经', '基金', '私募', '信托', '公募', '投行'],
    # 财经-期货
    ['财经', '期货', '贵金属', '黄金', '外汇', '原油', '现货', '螺纹钢', '大豆'],
    # 财经-金融
    ['财经', '银行', '银行业', '银监会', '理财'],

    # 教育-学前教育
    ['教育', '学前教育', '早教', '幼教', '幼儿园', '宝贝', '宝宝', '亲子', '学龄前'],
    # 教育-性教育
    ['教育', '性教育', '防性侵', '性知识', '部位', '隐私'],
    # 教育-小学
    ['教育', '小学', '小学老师', '四年级', '五年级', '民办小学'],
    # 教育-中学
    ['教育', '中学', '初一', '初二', '初三', '初高中', '二中', '理科', '试验中学'],
    # 教育-高考
    ['教育', '高考', '状元', '艺考', '填志愿', '录取', '裸分', '保送生'],
    # 教育-留学
    ['教育', '留学', '留学签证', '护照', '大学预科', '出国深造', '交换生', 'TESOL'],
    # 教育-国考公考
    ['教育', '公务员', '事业单位', '国考', '司考', '省考', '公考', '行测', '申论', '面试', '题型'],
    # 教育-院校
    ['教育', '院校', '高校', '名牌大学'],
    # 教育-大学
    ['教育', '大学', '期末', '专业课', '本科', '学生会'],
    # 教育-特教
    ['教育', '特教', '残疾儿童', '残障儿童', '特殊教育'],
    # 教育-职业考试
    ['教育', '执业资格', '资格考试', '会计', '建筑师', '监理'],
    # 教育-外语
    ['教育', '外语', '英语', '日语', '托福', '雅思'],

    # 娱乐-电影
    ['娱乐', '电影', '导演', '主演', '制片人', '影星', '编剧', '饰演', '票房'],
    # 娱乐-电视
    ['娱乐', '电视剧', '古装剧', '网剧', '影视剧', '韩剧', '偶像剧'],
    # 娱乐-综艺
    ['娱乐', '综艺', '收视率', '女主持', '快本', '湖南卫视', '跑男'],
    # 娱乐-音乐
    ['娱乐', '音乐', '专辑', '唱片'],

    # 饮食-美食
    ['美食', '老饕', '菜谱', '私房菜', '名厨', '料理', '菜品'],
    # 饮食-菜谱
    ['菜谱', '做菜', '烹饪', '作料'],

    # 游戏电竞
    ['游戏', '手游', '战队', '电竞', '王者', 'XBOX', 'PS'],

    # 科技-互联网
    ['科技', '互联网', '阿里巴巴', '腾讯', '京东', '百度', '谷歌', 'Facebook', '亚马逊', '风口', '泡沫', 'APP'],
    # 科技-手机
    ['科技', '手机', '华为', '小米', '苹果', '三星', '安卓', 'IOS', '运存'],
    # 科技-AI
    ['科技', 'AI', '人工智能', '算法', '神经网络'],
    # 科技-数码PC
    ['科技', '数码', '相机', '笔记本电脑', '微单', '平板', 'PC', '显卡', 'CPU', '硬盘', '主板'],
    # 科技-通讯
    ['通讯', '移动', '联通', '电信', '套餐', '流量', '网络', '运营商'],
    # 自然科学-宇宙物理
    ['自然科学', '宇宙', 'NASA', '气候', '量子', '暗物质', '物理'],
    # 自然科学-地球
    ['自然科学', '地球', '气候', '海洋', '冰川', '洋流'],
    # 自然科学-生物
    ['自然科学', '生物圈', '生态', '基因'],

    # 旅游-旅游
    ['旅游', '国内游', '自驾游', '近郊游', '出境游', '境外游', '签证', '自由行'],

    # 动物-宠物
    ['宠物', '主人', '狗狗', '猫咪', '兔子', '仓鼠', '鹦鹉'],

    # 军事-海军
    ['军事', '海军', '航母'],
    # 军事-空军
    ['军事', '空军', '五代机'],
    # 军事-陆军
    ['军事', '陆军', '武警', '军区'],
    # 军事-武器
    ['军事', '武器', '兵器', '导弹'],

    # 港澳台
    ['港澳台', '香港', '尖沙咀', '香港市民', '台湾', '台湾当局', '民进党', '绿营', '澳门'],

    # 健康-男性
    ['健康', '阳痿', '前列腺', '早泄', '精子'],
    # 健康-女性
    ['健康', '妇科', '子宫', '乳房', '月经', '乳腺癌', '孕期', '产前', '产后', '怀孕'],
    # 健康-疾控
    ['健康', '疾控', '病毒', '疫情', '禽流感', '疫苗', '接种'],
    # 健康-整形
    ['整形', '美容', '手术', '玻尿酸', '种植', '丰胸'],
    # 健康-医患
    ['健康', '手术', '患者', '医生', '医院'],
    # 健康-肿瘤
    ['健康', '肿瘤', '化疗', '癌细胞', '靶向', '癌症'],
    # 健康-骨关节
    ['健康', '关节', '颈椎', '骨骼', '腰椎', '脊柱', '骨折'],
    # 健康-心血管
    ['健康', '心脏', '血压', '血栓', '心梗', '脑血管'],
    # 健康-口腔
    ['健康', '牙齿', '口腔', '刷牙', '龋齿', '咀嚼'],
    # 健康-精神
    ['健康', '抑郁', '精神病', '癫痫', '焦虑症', '人格障碍'],
    # 健康-肛肠
    ['健康', '肛门', '直肠', '尿道', '痔疮'],
    # 健康-眼睛
    ['健康', '眼科', '视力', '白内障'],
    # 健康-糖尿病
    ['健康', '糖尿病', '血糖', '痛风', '尿酸'],
    # 健康-养生
    ['养生', '健康', '养生之道', '补肾', '护肝', '护肺', '食疗', '益气养血', '养胃', '排毒', '穴位', '睡眠', '房事'],
    # 健康-健身
    ['健身', '饮食', '脂肪', '减肥餐', '瑜伽'],
    # 母婴
    ['母婴', '宝宝', '母乳', '婴儿', '辅食', '黄疸', '小儿', '胎儿'],
    # 美容
    ['美容', '护肤', '美白', '抗皱', '祛痘', '纤体'],

    # 法制-交通
    ['交警', '交通法规', '交规', '醉驾', '高速', '肇事', '死亡', '红灯'],
    # 法制-刑侦
    ['刑侦', '侦查', '侦破', '嫌疑人', '杀人'],
    # 法制-公安
    ['警方', '派出所', '民警'],
    # 法制-斗殴
    ['斗殴', '冲突', '纠纷', '肢体冲突'],
    # 法制-诈骗
    ['诈骗', '敲诈勒索'],
    # 法制-对外合作
    ['引渡', '境外', '遣返'],
    # 法制-盗窃
    ['盗窃', '被盗', '赃物'],
    # 法制-色情
    ['卖淫', '嫖客', '小姐', '色情'],
    # 法制-赌博
    ['赌博', '赌客', '赌资'],
    # 法制-毒品
    ['毒品', '贩毒', '吸毒'],
    # 法制-家暴
    ['家暴', '施暴', '冷暴力', '家丑不可外扬'],
    # 法制-暴恐
    ['恐怖主义', '境外', '煽动', '暴恐'],
    # 法制-职务犯罪
    ['受贿', '违法违纪', '贪污', '腐败'],
    # 法制-判决
    ['诉讼', '法院', '判决'],
    # 法制-信访
    ['信访', '上访'],
    # 法制-涉枪
    ['枪击', '枪手', '枪击案'],

    # 房产地产-房产
    ['开发商', '开盘', '小区', '商品房'],
    # 房产地产-销售租赁
    ['房屋', '合同', '买卖', '租赁', '过户', '二手房'],
    # 房产地产-土地改造
    ['地价', '土地', '政策', '溢价', '土地出让', '拆迁', '旧城改造'],
    # 房产地产-房价楼市
    ['楼市', '房价', '房地产', '炒房'],
    # 房产地产-家装
    ['装修', '家装', '验房', '软装', '主材', '板材', '吊顶', '贴砖', '报价单', '合同'],
    # 房产地产-家居
    ['家居', '风格', '装饰', '家具', '沙发', '厨卫'],

    # 交通-火车
    ['交通', '火车', '列车', '动车', '高铁', '购票', '车次', '方向', '铁路'],
    # 交通-航空
    ['航班', '航线', '机场', '航空', '天气', '延误', '机票'],
    # 交通-公路
    ['高速', '收费站', '出口', '封闭', '省道', '国道', '服务区'],
    # 交通-城市
    ['交通', '公交', '出租车', '地铁', '交通卡', '轨道交通', '公交公司', '出入口', '换乘'],
    # 交通-自驾
    ['大桥', '大道', '隧道', '路段', '高架', '安全驾驶', '文明出行', '单行道', '限行', '斑马线', '机动车', '行人'],

    # 时尚-时装
    ['时尚', '外套', '衬衫' '眼镜', '搭配', '服饰', '围巾', '裙子', '面料', '款式', '时髦'],
    # 时尚-奢品
    ['时尚', '腕表', '手表', '钻石', '珠宝', '皮草', '劳力士', '古驰', '普拉达', '爱马仕'],
    # 时尚-妆容
    ['时尚', '妆容', '发型' '眼线', '睫毛', '唇膏', '底妆', '粉底'],

    # 天气-预报
    ['天气预报', '地区', '气温', '阵雨', '白天', '局部'],
    # 天气-预警
    ['气象台', '预警', '台风', '雷暴', '红色', '黄色'],

    # 灾难-自然
    ['地震', '震源', '海啸', '火山', '海域', '地震局', '龙卷风', '飓风'],
    # 灾难-空难
    ['飞机', '坠毁', '残骸', '遇难', '空难', '搜救'],
    # 灾难-水上
    ['船舶', '海上', '搜救', '遇险', '救援'],
    # 灾难-火
    ['火灾', '起火', '现场', '燃烧', '浓烟', '山火', '消防'],
    # 灾难-交通
    ['火车', '脱轨', '事故', '死亡', '翻车'],
    # 灾难-事故
    ['爆炸', '中毒', '事故', '死亡', '安全事故', '特大事故'],
    # 灾难-水
    ['洪水', '内涝', '地质灾害', '汛期', '暴雨'],

    # 封建迷信-星座
    ['星座', '金牛座', '双鱼座', '天蝎座', '双子男', '射手女', '恋爱'],
    # 封建迷信-风水
    ['风水', '吉凶', '喜忌', '主财', '五行', '八字'],
    # 封建迷信-生肖
    ['生肖', '命格', '生肖蛇', '属羊人', '寅虎', '福运'],

    # 情感-青春
    ['青春', '毕业', '回忆', '梦想', '岁月', '花季', '青葱', '青春年少'],
    # 情感-爱情
    ['恋爱', '表白', '男生', '女孩', '男朋友', '感情', '情侣', '爱情', '劈腿', '暗恋', '初恋'],
    # 情感-结婚
    ['婚礼', '新人', '新娘', '结婚', '婚纱', '求婚', '婚宴', '蜜月', '幸福'],
    # 情感-家庭
    ['家庭', '夫妻', '丈夫', '媳妇', '婆媳', '妯娌', '感情', '婚姻', '吵架', '和睦', '爸爸', '妈妈', '孩子'],
    # 情感-老人
    ['老人', '老伴', '敬老院', '赡养', '高龄', '照顾'],

    # 民生-医疗社保
    ['医疗', '参保', '报销', '社保', '农合', '政策', '公积金'],
    # 民生-养老
    ['退休', '年龄', '人社部', '养老', '养老金', '政策', '社区'],
    # 民生-工伤
    ['工伤', '劳动法', '职业病', '劳动合同'],
    # 民生-安居
    ['住房', '住建部', '保障', '公租房', '安置房'],
    # 民生-五险一金
    ['五险一金', '福利', '城镇', '保险费率', '缴存'],
    # 民生-低保特困照顾
    ['低保', '救助', '补贴', '扶贫', '保障', '残疾人', '特困', '退伍', '军属'],
    # 民生-休假
    ['休假', '节假日', '法定', '调休', '假期', '带薪'],
    # 民生-居住环境
    ['垃圾', '生活', '分类', '焚烧', '污水'],
    # 民生-医疗
    ['医院', '挂号', '预约', '就诊', '看病', '急诊', '三甲', '医改'],
    # 民生-证件
    ['身份证', '居住证', '户口簿', '暂住证', '户籍', '申请', '护照', '民政'],
    # 民生-家政
    ['家政', '月嫂', '保姆', '护理', '陪护', '保洁'],
    # 民生-食品安全
    ['食品', '餐饮', '卫生', '监管', '检查', '药监局'],
    # 民生-市政
    ['市政', '公园', '绿化', '下水道', '规划', '设施', '场地'],
    # 民生-水电气
    ['停电', '停水', '通知', '恢复', '检修', '小区', '影响', '停气', '供暖', '月日'],
    # 民生-政务
    ['政务', '行政', '便民', '服务', '办事', '窗口', '热线'],
    # 民生-物业
    ['物业', '物管', '业主', '业委会', '停车'],
    # 民生-个税
    ['个税', '个人所得税', '起征点', '财产税', '个人', '收入'],

    # 文史-二战
    ['二战', '纳粹', '法西斯', '轴心国', '抗日', '南京大屠杀'],
    # 文史-民国名人
    ['民国', '蔡元培', '陈寅恪', '冯友兰'],
    # 文史-国共
    ['红军', '井冈山', '毛泽东', '蒋介石', '八路军', '新四军', '渡江战役', '志愿军'],
    # 文史-古典名著
    ['三国', '水浒', '西游记', '红楼梦', '金庸', '唐诗', '宋词'],
    # 文史-历朝历代
    ['乾隆', '康熙', '雍正', '朱元璋', '李世民', '宋高宗', '元朝', '李渊', '秦始皇', '刘邦'],
    # 文史-书画
    ['书法', '书画', '油画', '艺术', '展览', '文化', '雕塑', '画展'],
    # 文史-文学
    ['文学', '作家', '小说', '出版', '写作', '文化', '阅读'],
    # 文史-文物
    ['文物', '保护', '古迹', '遗产', '非遗', '民俗'],
    # 文史-演出展览
    ['纪念馆', '博物馆', '美术馆', '图书馆', '开放', '音乐厅', '售票'],

    # 职场就业-毕业
    ['就业', '专业', '职业', '规划', '方向', '学历', '毕业生', '应届', '实习', '校招'],
    # 职场就业-招聘面试离职
    ['招聘', '面试', '应聘', '求职者', '薪酬', '跳槽', '裁员', '加班', '底薪', '辞职'],
    # 职场就业-管理
    ['公司', '领导', '员工', '团队', '企业', '效率', '管理', '职场'],
    # 职场就业-营销
    ['营销', '客户', '广告', '推广', '商业模式', '销售', '渠道'],

    # 汽车-学车
    ['驾校', '科目', '教练', '机动车', '摇号', '路考', '离合', '刹车', '学车'],
    # 汽车-厂商
    ['广汽', '丰田', '三菱', '宝马', '奔驰', '比亚迪', 'SUV', '轿车', '合资', '国产', '车型', '销量'],
    # 汽车-保养
    ['保养', '汽车', '车主', '维修', '配件', '故障', '售后服务'],

    # 国际-美国
    ['美国', '白宫', '总统', '发言人'],
    # 国际-韩国
    ['韩国', '政府', '总统', '韩媒', '首尔'],
    # 国际-日本
    ['日本', '首相', '日媒', '自卫队', '朝日新闻'],
    # 国际-印度
    ['印度', '印媒', '政府', '总理'],
    # 国际-英国
    ['英国', '首相', '政府', '英媒', '泰晤士报'],
    # 国际-内政竞选
    ['国际', '竞选', '选票', '大选', '任期', '支持率', '民调', '改组', '议会', '内阁'],
    # 国际-政变暴乱
    ['政变', '叛乱', '暴动', '内战', '叛军', '在野党', '反对派', '武装'],
    # 国际-外交
    ['外交', '访问', '接见', '会晤', '两国'],

    # 国际-韩朝
    ['朝鲜', '韩国', '导弹', '朝韩'],
    # 国际-南海
    ['南海', '岛礁', '黄岩岛', '争议', '争端'],
    # 国际-恐怖主义
    ['ISIS', '圣战', '反恐', '恐怖袭击'],
    # 国际-国际关系
    ['制裁', '谴责', '外交', '干涉', '斡旋'],
    # 国际-巴以
    ['中东', '巴以', '戈兰高地', '以色列', '巴解组织', '加沙'],
    # 国际-中东
    ['中东', '沙特', '伊拉克', '伊朗'],

    # 行业-农业
    ['农业', '土地', '种植', '粮食作物', '生猪', '养殖', '经济作物', '水果'],
    # 行业-电商
    ['电商', '双十一', '网购', '关税', '物流'],
    # 行业-电力
    ['电力', '电网', '发电量', '火电', '核电', '风电'],
    # 行业-基建
    ['基建', '工程', '进度', '验收', '投入使用'],
    # 行业-家电
    ['家电', '电视', '冰箱', '热水器', '空调'],
    # 行业-零售
    ['零售', '商超', '渠道', '卖场', '连锁', '快消品', '线下'],
    # 行业-钢铁
    ['钢铁', '产能', '钢厂', '产量', '有色', '冶炼', '有色金属'],
    # 行业-外贸
    ['外贸', '进出口', '海关', '自贸区', '保税仓库', '跨境'],
    # 行业-制造业
    ['制造业', '小商品', '五金', '工业'],
    # 行业-糖酒
    ['烟草', '糖酒', '葡萄酒', '白酒', '茅台'],
    # 行业-能源
    ['能源', '光伏', '石油', '天然气', '能源供应', '风能', '清洁', '环保'],
    # 行业-医药
    ['医药', '药业', '制药', '医疗器械', '研发', '医疗设备'],
    # 行业-收藏
    ['收藏', '字画', '钱币', '拍卖', '古玩', '纪念币', '发行', '工艺品'],
    # 行业-经济
    ['经济', 'GDP', '增长', '放缓'],

    # 时政-打老虎
    ['违法', '违纪', '公职', '情节严重', '党纪政纪', '腐败', '党籍', '反腐', '涉嫌', '党内', '处分', '纪委'],
    # 时政-时代精神
    ['精神', '讲话', '强调', '贯彻', '坚持'],
    # 时政-部委规定
    ['交通部', '财政部', '公安部', '人社部', '试点', '批复', '号文'],

]


labels_words_dict = {'92': ['房产地产', '房产', 'None', ['开发商', '开盘', '小区', '商品房']], '169': ['国际', '中东', 'None', ['中东', '沙特', '伊拉克', '伊朗']], '27': ['教育', '小学', 'None', ['教育', '小学', '小学老师', '四年级', '五年级', '民办小学', '孩子']], '207': ['法制', '刑侦', '经济犯罪', ['庞氏骗局', '洗钱', '非法融资', '商标', '银行', '账户', '财物', '制假']], '175': ['行业', '零售', 'None', ['零售', '商超', '渠道', '卖场', '连锁', '快消品', '线下']], '24': ['财经', '金融', 'None', ['财经', '银行', '银行业', '银监会', '理财']], '106': ['天气', '预报', 'None', ['天气预报', '地区', '气温', '阵雨', '白天', '局部']], '147': ['文史', '文物', 'None', ['文物', '保护', '古迹', '遗产', '非遗', '民俗']], '226': ['健康', '养生', '食疗怀孕', ['怀孕', '孕妇', '食谱', '宝宝', '发育', '健康', '吸收', '蛋白质']], '130': ['民生', '居住环境', 'None', ['垃圾', '生活', '分类', '焚烧', '污水']], '23': ['财经', '期货', 'None', ['财经', '期货', '贵金属', '黄金', '外汇', '原油', '现货', '螺纹钢', '大豆']], '30': ['教育', '留学', 'None', ['教育', '留学', '留学签证', '护照', '大学预科', '出国深造', '交换生', 'TESOL']], '50': ['自然科学', '地球', 'None', ['自然科学', '地球', '气候', '海洋', '冰川', '洋流']], '95': ['房产地产', '房价楼市', 'None', ['楼市', '房价', '房地产', '炒房']], '114': ['灾难', '水', 'None', ['洪水', '内涝', '地质灾害', '汛期', '暴雨']], '188': ['法制', '公安', '拾金不昧', ['派出所', '民警', '诚信', '拾金不昧']], '168': ['国际', '巴以', 'None', ['中东', '巴以', '戈兰高地', '以色列', '巴解组织', '加沙']], '76': ['法制', '交通', 'None', ['交警', '交通法规', '交规', '醉驾', '高速', '肇事', '死亡', '红灯']], '156': ['国际', '美国', 'None', ['美国', '白宫', '总统', '发言人']], '205': ['动物', '宠物', '猫', ['喵星人', '宠物', '猫奴', '流浪猫', '萌宠', '奶猫']], '152': ['职场就业', '营销', 'None', ['营销', '客户', '广告', '推广', '商业模式', '销售', '渠道']], '26': ['教育', '性教育', 'None', ['教育', '性教育', '防性侵', '性知识', '部位', '隐私']], '124': ['民生', '养老', 'None', ['退休', '年龄', '人社部', '养老', '养老金', '政策', '社区']], '173': ['行业', '基建', 'None', ['基建', '工程', '进度', '验收', '投入使用']], '31': ['教育', '国考公考', 'None', ['教育', '公务员', '事业单位', '国考', '司考', '省考', '公考', '行测', '申论', '面试', '题型']], '13': ['体育', '赛车', 'None', ['赛车', '赛道', '轮胎', '车手', '车队']], '33': ['教育', '大学', 'None', ['教育', '大学', '期末', '专业课', '本科', '学生会']], '58': ['港澳台', 'None', 'None', ['港澳台', '香港', '尖沙咀', '香港市民', '台湾', '台湾当局', '民进党', '绿营', '澳门']], '113': ['灾难', '事故', 'None', ['爆炸', '中毒', '事故', '死亡', '安全事故', '特大事故']], '201': ['行业', '农业', '畜牧', ['养殖', '畜牧业', '肉质', '畜禽', '饲料']], '166': ['国际', '恐怖主义', 'None', ['ISIS', '圣战', '反恐', '恐怖袭击']], '15': ['体育', '台球', 'None', ['斯诺克', '台球', '丁俊晖', '奥沙利文']], '38': ['娱乐', '电视', 'None', ['娱乐', '电视剧', '古装剧', '网剧', '影视剧', '韩剧', '偶像剧']], '68': ['健康', '精神', 'None', ['健康', '抑郁', '精神病', '癫痫', '焦虑症', '人格障碍']], '193': ['情感', '青春', '温暖', ['感动', '温暖', '爱', '彼此', '苦难', '呵护']], '18': ['体育', '游泳', 'None', ['游泳', '泳池', '自由泳', '仰泳', '游泳队', '三米板']], '11': ['体育', '拳击搏击', 'None', ['拳击', '直拳', '金腰带', '拳王', '搏击']], '228': ['健康', '养生', '食疗排毒', ['排毒', '肝脏', '养肝', '杀菌', '清洁']], '36': ['教育', '外语', 'None', ['教育', '外语', '英语', '日语', '托福', '雅思']], '71': ['健康', '糖尿病', 'None', ['健康', '糖尿病', '血糖', '痛风', '尿酸']], '181': ['行业', '医药', 'None', ['医药', '药业', '制药', '医疗器械', '研发', '医疗设备']], '103': ['时尚', '时装', 'None', ['时尚', '外套', '衬衫眼镜', '搭配', '服饰', '围巾', '裙子', '面料', '款式', '时髦']], '79': ['法制', '斗殴', 'None', ['斗殴', '冲突', '纠纷', '肢体冲突']], '81': ['法制', '对外合作', 'None', ['引渡', '境外', '遣返']], '150': ['职场就业', '招聘面试离职', 'None', ['招聘', '面试', '应聘', '求职者', '薪酬', '跳槽', '裁员', '加班', '底薪', '辞职']], '54': ['军事', '海军', 'None', ['军事', '海军', '航母']], '223': ['情感', '爱情', '故事名人', ['媒体', '明星', '恋爱', '私生活', '娱乐圈', '结婚']], '191': ['情感', '爱情', '故事', ['恋爱', '情侣', '娶妻', '婚后', '男子', '女孩', '折磨', '故事']], '120': ['情感', '结婚', 'None', ['婚礼', '新人', '新娘', '结婚', '婚纱', '求婚', '婚宴', '蜜月', '幸福']], '122': ['情感', '老人', 'None', ['老人', '老伴', '敬老院', '赡养', '高龄', '照顾']], '224': ['健康', '养生', '食疗抗癌', ['抗癌', '癌症', '癌细胞', '疾病', '预防', '保护', '食物']], '215': ['饮食', '菜谱', '实惠美食', ['过瘾', '丰盛', '好吃', '实惠', '新鲜', '满足']], '139': ['民生', '个税', 'None', ['个税', '个人所得税', '起征点', '财产税', '个人', '收入']], '116': ['封建迷信', '风水', 'None', ['风水', '吉凶', '喜忌', '主财', '五行', '八字']], '40': ['娱乐', '音乐', 'None', ['娱乐', '音乐', '专辑', '唱片']], '172': ['行业', '电力', 'None', ['电力', '电网', '发电量', '火电', '核电', '风电']], '153': ['汽车', '学车', 'None', ['驾校', '科目', '教练', '机动车', '摇号', '路考', '离合', '刹车', '学车']], '29': ['教育', '高考', 'None', ['教育', '高考', '状元', '艺考', '填志愿', '录取', '裸分', '保送生']], '151': ['职场就业', '管理', 'None', ['公司', '领导', '员工', '团队', '企业', '效率', '管理', '职场']], '28': ['教育', '中学', 'None', ['教育', '中学', '初一', '初二', '初三', '初高中', '二中', '理科', '试验中学']], '45': ['科技', '手机', 'None', ['科技', '手机', '华为', '小米', '苹果', '三星', '安卓', 'IOS', '运存']], '67': ['健康', '口腔', 'None', ['健康', '牙齿', '口腔', '刷牙', '龋齿', '咀嚼']], '73': ['健康', '健身', 'None', ['健身', '饮食', '脂肪', '减肥餐', '瑜伽']], '93': ['房产地产', '销售租赁', 'None', ['房屋', '合同', '买卖', '租赁', '过户', '二手房']], '162': ['国际', '政变暴乱', 'None', ['政变', '叛乱', '暴动', '内战', '叛军', '在野党', '反对派', '武装']], '212': ['饮食', '菜谱', '窍门', ['烹调', '诀窍', '收藏', '手法', '精华', '作料', '调味']], '155': ['汽车', '保养', 'None', ['保养', '汽车', '车主', '维修', '配件', '故障', '售后服务']], '3': ['体育', '足球', '德甲', ['足球', '德甲', '拜仁', '多特蒙德', '沃尔夫斯堡', '不莱梅', '勒沃库森', '法兰克福']], '170': ['行业', '农业', 'None', ['农业', '土地', '种植', '粮食作物', '生猪', '养殖', '经济作物', '水果']], '190': ['情感', '爱情', '美文', ['爱情', '情侣', '恋爱', '表白', '付出', '感情', '承诺', '幸福', '婚姻', '美文']], '9': ['体育', '乒乓球', 'None', ['乒乓球', '国际乒联', '正胶', '国乒']], '131': ['民生', '医疗', 'None', ['医院', '挂号', '预约', '就诊', '看病', '急诊', '三甲', '医改']], '213': ['时尚', '时装', '明星', ['模特', '身高', '气场', '新颖', '性感', '明星', '搭配', '穿衣', '时尚', '高挑', '淑女', '潮流']], '52': ['旅游', '旅游', 'None', ['旅游', '国内游', '自驾游', '近郊游', '出境游', '境外游', '签证', '自由行']], '75': ['美容', 'None', 'None', ['美容', '护肤', '美白', '抗皱', '祛痘', '纤体']], '20': ['体育', '奥运', 'None', ['奥运会', '冬奥会', '残奥会']], '61': ['健康', '疾控', 'None', ['健康', '疾控', '病毒', '疫情', '禽流感', '疫苗', '接种']], '0': ['体育', '足球', 'None', ['足球', '射门', '任意球', '点球', '红牌', '黄牌', '金球']], '211': ['饮食', '菜谱', '地方美食', ['农村', '美食', '食材', '传统', '自制']], '44': ['科技', '互联网', 'None', ['科技', '互联网', '阿里巴巴', '腾讯', '京东', '百度', '谷歌', 'Facebook', '亚马逊', '风口', '泡沫', 'APP']], '204': ['动物', '宠物', '狗', ['品种', '铲屎官', '哈士奇', '萨摩耶', '柴犬', '汪星人']], '99': ['交通', '航空', 'None', ['航班', '航线', '机场', '航空', '天气', '延误', '机票']], '179': ['行业', '糖酒', 'None', ['烟草', '糖酒', '葡萄酒', '白酒', '茅台']], '16': ['体育', '跑步马拉松', 'None', ['马拉松', '中长跑', '半马', '越野跑', '跑者']], '164': ['国际', '韩朝', 'None', ['朝鲜', '韩国', '导弹', '朝韩']], '69': ['健康', '肛肠', 'None', ['健康', '肛门', '直肠', '尿道', '痔疮']], '167': ['国际', '国际关系', 'None', ['制裁', '谴责', '外交', '干涉', '斡旋']], '65': ['健康', '骨关节', 'None', ['健康', '关节', '颈椎', '骨骼', '腰椎', '脊柱', '骨折']], '135': ['民生', '市政', 'None', ['市政', '公园', '绿化', '下水道', '规划', '设施', '场地']], '37': ['娱乐', '电影', 'None', ['娱乐', '电影', '导演', '主演', '制片人', '影星', '编剧', '饰演', '票房']], '89': ['法制', '判决', 'None', ['诉讼', '法院', '判决']], '6': ['体育', '篮球', '中国篮球', ['篮球', 'CBA', '宏远', '五棵松', '八一男篮', '首钢', '宏远队', '东莞队', '新疆队', '朱芳雨', '王仕鹏']], '98': ['交通', '火车', 'None', ['交通', '火车', '列车', '动车', '高铁', '购票', '车次', '方向', '铁路']], '56': ['军事', '陆军', 'None', ['军事', '陆军', '武警', '军区']], '186': ['时政', '部委规定', 'None', ['交通部', '财政部', '公安部', '人社部', '试点', '批复', '号文']], '39': ['娱乐', '综艺', 'None', ['娱乐', '综艺', '收视率', '女主持', '快本', '湖南卫视', '跑男']], '165': ['国际', '南海', 'None', ['南海', '岛礁', '黄岩岛', '争议', '争端']], '53': ['动物', '宠物', 'None', ['宠物', '主人', '狗狗', '猫咪', '兔子', '仓鼠', '鹦鹉']], '225': ['健康', '养生', '食疗美容', ['衰老', '雌激素', '补血', '美容', '养颜', '延缓', '滋阴']], '140': ['文史', '二战', 'None', ['二战', '纳粹', '法西斯', '轴心国', '抗日', '南京大屠杀']], '184': ['时政', '打老虎', 'None', ['违法', '违纪', '公职', '情节严重', '党纪政纪', '腐败', '党籍', '反腐', '涉嫌', '党内', '处分', '纪委']], '107': ['天气', '预警', 'None', ['气象台', '预警', '台风', '雷暴', '红色', '黄色']], '178': ['行业', '制造业', 'None', ['制造业', '小商品', '五金', '工业']], '119': ['情感', '爱情', 'None', ['恋爱', '表白', '男生', '女孩', '男朋友', '感情', '情侣', '爱情', '劈腿', '暗恋', '初恋']], '105': ['时尚', '妆容', 'None', ['时尚', '妆容', '发型眼线', '睫毛', '唇膏', '底妆', '粉底']], '42': ['饮食', '菜谱', 'None', ['菜谱', '做菜', '烹饪', '作料']], '141': ['文史', '民国名人', 'None', ['民国', '蔡元培', '陈寅恪', '冯友兰']], '138': ['民生', '物业', 'None', ['物业', '物管', '业主', '业委会', '停车']], '62': ['健康', '整形', 'None', ['整形', '美容', '手术', '玻尿酸', '种植', '丰胸']], '21': ['财经', '股票', 'None', ['财经', '股票', '股价', '大盘', '市值', '创业板', '证监会']], '194': ['情感', '青春', '伤痛', ['情感', '疼痛', '失望', '折磨', '绝望', '时间', '成长', '经历', '忍受']], '90': ['法制', '信访', 'None', ['信访', '上访']], '143': ['文史', '古典名著', 'None', ['三国', '水浒', '西游记', '红楼梦', '金庸', '唐诗', '宋词']], '59': ['健康', '男性', 'None', ['健康', '阳痿', '前列腺', '早泄', '精子']], '2': ['体育', '足球', '英超', ['足球', '英超', '曼联', '曼城', '利物浦', '阿森纳', '切尔西']], '149': ['职场就业', '毕业', 'None', ['就业', '专业', '职业', '规划', '方向', '学历', '毕业生', '应届', '实习', '校招']], '111': ['灾难', '火', 'None', ['火灾', '起火', '现场', '燃烧', '浓烟', '山火', '消防']], '104': ['时尚', '奢品', 'None', ['时尚', '腕表', '手表', '钻石', '珠宝', '皮草', '劳力士', '古驰', '普拉达', '爱马仕']], '85': ['法制', '毒品', 'None', ['毒品', '贩毒', '吸毒']], '49': ['自然科学', '宇宙物理', 'None', ['自然科学', '宇宙', 'NASA', '气候', '量子', '暗物质', '物理']], '196': ['情感', '家庭', '婆媳', ['婆婆', '儿子', '儿媳', '公婆']], '84': ['法制', '赌博', 'None', ['赌博', '赌客', '赌资']], '70': ['健康', '眼睛', 'None', ['健康', '眼科', '视力', '白内障']], '198': ['健康', '养生', '瘦身', ['健康', '减肥', '瘦身', '脂肪', '饮食', '卡路里', '水果']], '129': ['民生', '休假', 'None', ['休假', '节假日', '法定', '调休', '假期', '带薪']], '19': ['体育', '博彩', 'None', ['体彩', '欧赔', '足彩', '盘口']], '163': ['国际', '外交', 'None', ['外交', '访问', '接见', '会晤', '两国']], '22': ['财经', '基金', 'None', ['财经', '基金', '私募', '信托', '公募', '投行']], '182': ['行业', '收藏', 'None', ['收藏', '字画', '钱币', '拍卖', '古玩', '纪念币', '发行', '工艺品']], '192': ['情感', '爱情', '星座', ['爱情', '情感', '失去', '恋爱', '分手', '后悔', '水瓶', '狮子', '星座']], '47': ['科技', '数码PC', 'None', ['科技', '数码', '相机', '笔记本电脑', '微单', '平板', 'PC', '显卡', 'CPU', '硬盘', '主板']], '101': ['交通', '城市', 'None', ['交通', '公交', '出租车', '地铁', '交通卡', '轨道交通', '公交公司', '出入口', '换乘']], '48': ['科技', '通讯', 'None', ['通讯', '移动', '联通', '电信', '套餐', '流量', '网络', '运营商']], '159': ['国际', '印度', 'None', ['印度', '印媒', '政府', '总理']], '46': ['科技', 'AI', 'None', ['科技', 'AI', '人工智能', '算法', '神经网络']], '206': ['法制', '刑侦', '敲诈勒索', ['诈骗案', '犯罪团伙', '涉案', '敲诈', '勒索']], '221': ['情感', '爱情', '故事恋爱', ['情侣', '追求', '争吵', '冷战', '分手', '和好', '绝望', '女孩']], '209': ['健康', '女性', '月经', ['经期', '例假', '初潮', '生育能力', '痛经']], '133': ['民生', '家政', 'None', ['家政', '月嫂', '保姆', '护理', '陪护', '保洁']], '117': ['封建迷信', '生肖', 'None', ['生肖', '命格', '生肖蛇', '属羊人', '寅虎', '福运']], '132': ['民生', '证件', 'None', ['身份证', '居住证', '户口簿', '暂住证', '户籍', '申请', '护照', '民政']], '218': ['娱乐', '明星', '八卦', ['绯闻', '追求', '恋情', '明星', '分手', '出轨']], '125': ['民生', '工伤', 'None', ['工伤', '劳动法', '职业病', '劳动合同']], '91': ['法制', '涉枪', 'None', ['枪击', '枪手', '枪击案']], '94': ['房产地产', '土地改造', 'None', ['地价', '土地', '政策', '溢价', '土地出让', '拆迁', '旧城改造']], '41': ['饮食', '美食', 'None', ['美食', '老饕', '菜谱', '私房菜', '名厨', '料理', '菜品']], '63': ['健康', '医患', 'None', ['健康', '手术', '患者', '医生', '医院']], '57': ['军事', '武器', 'None', ['军事', '武器', '兵器', '导弹']], '160': ['国际', '英国', 'None', ['英国', '首相', '政府', '英媒', '泰晤士报']], '199': ['健康', '养生', '食疗', ['吃', '预防', '延缓', '功效', '作用', '食疗', '药用', '食用']], '80': ['法制', '诈骗', 'None', ['诈骗', '敲诈勒索']], '17': ['体育', '围棋', 'None', ['围棋', '棋谱', '九段', '中国棋院']], '154': ['汽车', '厂商', 'None', ['广汽', '丰田', '三菱', '宝马', '奔驰', '比亚迪', 'SUV', '轿车', '合资', '国产', '车型', '销量']], '100': ['交通', '公路', 'None', ['高速', '收费站', '出口', '封闭', '省道', '国道', '服务区']], '227': ['健康', '养生', '食疗野菜', ['野草', '野菜', '植物', '清热', '农村']], '174': ['行业', '家电', 'None', ['家电', '电视', '冰箱', '热水器', '空调']], '214': ['时尚', '时装', '健身', ['健身', '小蛮腰', '紧身', '运动', '时髦', '身材']], '12': ['体育', '网球', 'None', ['网球', '大满贯', '网坛', '红土', '发球局']], '78': ['法制', '公安', 'None', ['警方', '派出所', '民警']], '126': ['民生', '安居', 'None', ['住房', '住建部', '保障', '公租房', '安置房']], '127': ['民生', '五险一金', 'None', ['五险一金', '福利', '城镇', '保险费率', '缴存']], '10': ['体育', '排球', 'None', ['排球', '拦网', '女排', '男排', '二传']], '219': ['娱乐', '明星', '电影电视', ['导演', '演技', '演员', '作品', '试镜', '新剧']], '145': ['文史', '书画', 'None', ['书法', '书画', '油画', '艺术', '展览', '文化', '雕塑', '画展']], '189': ['娱乐', '明星', 'None', ['爱情', '恋爱', '分手', '情侣', '失恋', '前任', '明星', '演员', '婚讯', '结婚', '怀孕', '明星', '当红', '荧屏', '感情', '综艺', '成长', '演艺圈', '人设']], '82': ['法制', '盗窃', 'None', ['盗窃', '被盗', '赃物']], '202': ['行业', '农业', '副产品', ['加工', '制作', '农产品', '原材料', '食品', '蜂蜜']], '25': ['教育', '学前教育', 'None', ['教育', '学前教育', '早教', '幼教', '幼儿园', '宝贝', '宝宝', '亲子', '学龄前']], '110': ['灾难', '水上', 'None', ['船舶', '海上', '搜救', '遇险', '救援']], '102': ['交通', '自驾', 'None', ['大桥', '大道', '隧道', '路段', '高架', '安全驾驶', '文明出行', '单行道', '限行', '斑马线', '机动车', '行人']], '77': ['法制', '刑侦', 'None', ['刑侦', '侦查', '侦破', '嫌疑人', '杀人']], '216': ['饮食', '菜谱', '另类美食', ['食材', '重口味', '奇特', '黑暗料理', '创意', '奇葩', '独特']], '210': ['健康', '女性', '怀孕', ['备孕', '避孕', '卵巢', '排卵', '育龄', '经期']], '118': ['情感', '青春', 'None', ['青春', '毕业', '回忆', '梦想', '岁月', '花季', '青葱', '青春年少']], '157': ['国际', '韩国', 'None', ['韩国', '政府', '总统', '韩媒', '首尔']], '86': ['法制', '家暴', 'None', ['家暴', '施暴', '冷暴力', '家丑不可外扬']], '88': ['法制', '职务犯罪', 'None', ['受贿', '违法违纪', '贪污', '腐败']], '176': ['行业', '钢铁', 'None', ['钢铁', '产能', '钢厂', '产量', '有色', '冶炼', '有色金属']], '112': ['灾难', '交通', 'None', ['火车', '脱轨', '事故', '死亡', '翻车']], '66': ['健康', '心血管', 'None', ['健康', '心脏', '血压', '血栓', '心梗', '脑血管']], '96': ['房产地产', '家装', 'None', ['装修', '家装', '验房', '软装', '主材', '板材', '吊顶', '贴砖', '报价单', '合同']], '8': ['体育', '羽毛球', 'None', ['羽毛球', '扣杀', '国羽', '羽球', '羽坛', '羽联']], '171': ['行业', '电商', 'None', ['电商', '双十一', '网购', '关税', '物流']], '185': ['时政', '时代精神', 'None', ['精神', '讲话', '强调', '贯彻', '坚持']], '5': ['体育', '篮球', 'NBA', ['篮球', 'NBA', '火箭', '湖人', '乔丹', '马刺']], '109': ['灾难', '空难', 'None', ['飞机', '坠毁', '残骸', '遇难', '空难', '搜救']], '83': ['法制', '色情', 'None', ['卖淫', '嫖客', '小姐', '色情']], '146': ['文史', '文学', 'None', ['文学', '作家', '小说', '出版', '写作', '文化', '阅读']], '137': ['民生', '政务', 'None', ['政务', '行政', '便民', '服务', '办事', '窗口', '热线']], '74': ['母婴', 'None', 'None', ['母婴', '宝宝', '母乳', '婴儿', '辅食', '黄疸', '小儿', '胎儿']], '200': ['行业', '农业', '花卉', ['花朵', '叶子', '花型', '植物', '花期', '株型', '颜色']], '72': ['健康', '养生', 'None', ['养生', '健康', '养生之道', '补肾', '护肝', '护肺', '食疗', '益气养血', '养胃', '排毒', '穴位', '睡眠', '房事']], '128': ['民生', '低保特困照顾', 'None', ['低保', '救助', '补贴', '扶贫', '保障', '残疾人', '特困', '退伍', '军属']], '158': ['国际', '日本', 'None', ['日本', '首相', '日媒', '自卫队', '朝日新闻']], '217': ['饮食', '菜谱', '不健康', ['有害', '不卫生', '少吃', '垃圾食品', '医生', '添加剂']], '142': ['文史', '国共', 'None', ['红军', '井冈山', '毛泽东', '蒋介石', '八路军', '新四军', '渡江战役', '志愿军']], '35': ['教育', '职业考试', 'None', ['教育', '执业资格', '资格考试', '会计', '建筑师', '监理']], '208': ['法制', '刑侦', '盗窃抢劫', ['作案', '盗窃', '抢劫', '盗窃', '入室', '持械']], '87': ['法制', '暴恐', 'None', ['恐怖主义', '境外', '煽动', '暴恐']], '134': ['民生', '食品安全', 'None', ['食品', '餐饮', '卫生', '监管', '检查', '药监局']], '4': ['体育', '足球', '西甲', ['足球', '西甲', '皇马', '巴萨', '巴伦西亚', '马竞', '比利亚雷亚尔']], '123': ['民生', '医疗社保', 'None', ['医疗', '参保', '报销', '社保', '农合', '政策', '公积金']], '187': ['猎奇', 'None', 'None', ['猎奇', '怪异', '蟒蛇', '好奇']], '222': ['情感', '爱情', '故事婚姻', ['生活', '婚姻', '出轨', '埋怨', '日常']], '14': ['体育', '高尔夫', 'None', ['高尔夫', '挥杆', '小鸟球', '果岭']], '115': ['封建迷信', '星座', 'None', ['星座', '金牛座', '双鱼座', '天蝎座', '双子男', '射手女', '恋爱']], '32': ['教育', '院校', 'None', ['教育', '院校', '高校', '名牌大学']], '220': ['娱乐', '明星', '节目', ['综艺咖', '真人秀', '录制', '素人', '开播', '镜头', '氛围']], '64': ['健康', '肿瘤', 'None', ['健康', '肿瘤', '化疗', '癌细胞', '靶向', '癌症', '晚期']], '108': ['灾难', '自然', 'None', ['地震', '震源', '海啸', '火山', '海域', '地震局', '龙卷风', '飓风']], '43': ['游戏电竞', 'None', 'None', ['游戏', '手游', '战队', '电竞', '王者', 'XBOX', 'PS']], '60': ['健康', '女性', 'None', ['健康', '妇科', '子宫', '乳房', '月经', '乳腺癌', '孕期', '产前', '产后', '怀孕']], '34': ['教育', '特教', 'None', ['教育', '特教', '残疾儿童', '残障儿童', '特殊教育']], '121': ['情感', '家庭', 'None', ['家庭', '夫妻', '丈夫', '媳妇', '婆媳', '妯娌', '感情', '婚姻', '吵架', '和睦', '爸爸', '妈妈', '孩子']], '195': ['情感', '家庭', '夫妻', ['体谅', '争吵', '婚姻', '生活', '背叛', '离婚', '忍耐', '财产']], '183': ['行业', '经济', 'None', ['经济', 'GDP', '增长', '放缓']], '148': ['文史', '演出展览', 'None', ['纪念馆', '博物馆', '美术馆', '图书馆', '开放', '音乐厅', '售票']], '177': ['行业', '外贸', 'None', ['外贸', '进出口', '海关', '自贸区', '保税仓库', '跨境']], '51': ['自然科学', '生物', 'None', ['自然科学', '生物圈', '生态', '基因']], '180': ['行业', '能源', 'None', ['能源', '光伏', '石油', '天然气', '能源供应', '风能', '清洁', '环保']], '197': ['情感', '家庭', '亲子', ['父母', '孩子', '相处', '养育', '管教', '疼爱', '融洽', '学习', '生气', '感动']], '136': ['民生', '水电气', 'None', ['停电', '停水', '通知', '恢复', '检修', '小区', '影响', '停气', '供暖', '月日']], '55': ['军事', '空军', 'None', ['军事', '空军', '五代机']], '97': ['房产地产', '家居', 'None', ['家居', '风格', '装饰', '家具', '沙发', '厨卫']], '1': ['体育', '足球', '中国足球', ['足球', '中超', '恒大', '国安', '鲁能', '苏宁', '上港', '申花', '国家队', '男足']], '161': ['国际', '内政竞选', 'None', ['国际', '竞选', '选票', '大选', '任期', '支持率', '民调', '改组', '议会', '内阁']], '203': ['情感', '家庭', '生育', ['老婆', '二胎', '高龄', '宝宝']], '7': ['体育', '篮球', 'None', ['篮球', '投篮', '男篮', '女篮', '篮协', '扣篮', '盖帽']], '144': ['文史', '历朝历代', 'None', ['乾隆', '康熙', '雍正', '朱元璋', '李世民', '宋高宗', '元朝', '李渊', '秦始皇', '刘邦']]}
